/********************************************
* VINATRON EXEC WRITTEN BY VINCENT F. MANZO *
*            JANUARY 9 2023                 *
*    A PROGRAM FOR MOVING FILES FOR CMS     *
*********************************************/

TRACE E                                      /* ERROR TRACING */

PARSE ARG INFN INFT INFM OUTFN OUTFT OUTFM   /* PARSE ARGS */

/* BANNER START */
SAY "STARTING VINATRON'S MOVE UTILITY FOR VM"
SAY 'PROPERTY OF:'                           /* BANNER */
SAY 'VINATRON TECHNOLOGY AND ELECTRICAL'     /* BANNER END */

SIGNAL ON ERROR                              /* TEST RC OF COMMANDS */

/* TEST IF INPUT DD IS BLANK FOR INTERACTIVE INPUT */
IF LENGTH(INFN) = 0 THEN DO
 SAY 'INPUT FILENAME NOT SPECIFIED PLEASE INPUT A FILENAME'
 PULL INFN
END
IF LENGTH(INFT) = 0 THEN DO 
 SAY 'INPUT FILETYPE NOT SPECIFIED PLEASE INPUT A FILETYPE'
 PULL INFT
END
IF LENGTH(INFM) = 0 THEN DO
 SAY 'OUTPUT FILEMODE NOT SPECIFIED PLEASE INPUT A FILEMODE'
 PULL INFM
END

OUTPUT:
/* IF OUTPUT DD = '=' THEN OUTPUT = INPUT */
IF OUTFN = '=' THEN DO                    
 OUTFN = INFN                             
END                                       
IF OUTFT = '=' THEN DO                    
 OUTFT = INFT                             
END    
/* TEST IF OUTPUT DD IS BLANK FOR INTERACTIVE INPUT */
IF LENGTH(OUTFN) = 0 THEN DO
 SAY 'OUTPUT FILENAME NOT SPECIFIED PLEASE INPUT A NAME OR = FOR INPUT FILENAME'
 PULL OUTFN
 SIGNAL OUTPUT
END
IF LENGTH(OUTFT) = 0 THEN DO 
 SAY 'OUTPUT FILETYPE NOT SPECIFIED PLEASE INPUT A TYPE OR = FOR INPUT FILETYPE'
 PULL OUTFT
 SIGNAL OUTPUT
END
IF LENGTH(OUTFM) = 0 THEN DO
 SAY 'OUTPUT FILEMODE NOT SPECIFIED PLEASE INPUT A FILEMODE'
 PULL OUTFM
 SIGNAL OUTPUT
END

/* NOTIFY USER */
SAY 'MOVING FTOM:'INFN INFT INFM                        
SAY 'TO:'OUTFN OUTFT OUTFM                     
/* EXECUTE MOVE */
'COPY' INFN INFT INFM OUTFN OUTFT OUTFM '(REPLACE'
'ERASE' INFN INFT INFM

EXIT                                         /* END OF PROGRAM */

/*******************************************************/
/* ERROR HANDLER: COMMON EXIT FOR NONZERO RETURN CODES */
/*******************************************************/
ERROR:
SAY "UNEXPECTED RC" RC "FROM COMMAND:"
SAY "     " SOURCELINE(SIGL)
SAY "AT LINE" SIGL"."