/********************************************
*  RIPLIB EXEC WRITTEN BY VINCENT F. MANZO  *
*            SEPTEMBER 21 2026              *
*  A PROGRAM FOR FORMATTING DASD IN VM      *
*********************************************/

TRACE E                                      /* ERROR TRACING */

/* GRAB ARGUMENTS */
PARSE ARG FN FT SFM DFM

SAY COPIES('*',80)                           /* BANNER START */
SAY '*' CENTER(" STARTING VINATRON'S DASD FORMAT FACILITY ",76) '*'
SAY '*' CENTER(' PROPERTY OF: ',76) '*'       
SAY '*' CENTER(' VINATRON TECHNOLOGY AND ELECTRICAL ',76) '*' 
SAY COPIES('*',80)                           /* BANNER END */

SIGNAL ON ERROR                              /* TEST RC OF COMMANDS */

/* VALIDATE ARGUMENTS */
IF FN = '' THEN DO
	SAY 'MISSING FILE NAME'
	SIGNAL ERROR
END
IF FT = '' THEN DO
	SAY 'MISSING FILE TYPE'
	SIGNAL ERROR
END
IF SFM = '' THEN DO
	SAY 'MISSING SOURCE FILEMODE'
	SIGNAL ERROR
END
IF DFM = '' THEN DO
	SAY 'MISSING DESTINATION FILEMODE'
	SIGNAL ERROR
END
IF FT != 'LOADLIB' | FT != 'TXTLIB' | FT != 'MACLIB' THEN DO
	SAY 'FT NOT A LIBRARY MUST BE LOADLIB, TXTLIB, OR MACLIB'
	SIGNAL ERROR
END

/* CHECK LIBRARY FILE TYPE */
IF FT = 'LOADLIB' THEN DO
    CALL LOADLIB
END
IF FT = 'TXTLIB' THEN DO
    CALL TXTLIB
END
IF FT = 'MACLIB' THEN DO
    CALL MACLIB
END

LOADLIB:
'MAKEBUF'
SAY 'DUMPING LOADLIB' FN FT SFM 
SAY 'WITH DESTINATION FILEMODE' DFM
MEMBERS = QUEUED()
'LOADLIB MAP' FN '(STACK' 
DO WHILE QUEUED() > MEMBERS
    PULL MEMBER
    SAY 'PROCESSING MEMBER' MEMBER
    'FILEDEF INMOVE DISK' FN FT SFM '(MEMBER' MEMBER
    'FILEDEF OUTMOVE DISK' MEMBER 'MODULE' DFM
    'MOVEFILE'
END
SAY 'FINISHED PROCESSING LOADLIB' FN FT SFM 
SAY 'ALL MEMBERS PROCESSED TO' DFM
'DROPBUF'
RETURN

TXTLIB:
SAY 'DUMPING TXTLIB' FN FT SFM 
SAY 'WITH DESTINATION FILEMODE' DFM
RETURN

MACLIB:
SAY 'DUMPING MACLIB' FN FT SFM 
SAY 'WITH DESTINATION FILEMODE' DFM
RETURN

/*******************************************************/
/* ERROR HANDLER: COMMON EXIT FOR NONZERO RETURN CODES */
/*******************************************************/
ERROR:
SAY "UNEXPECTED RC" RC "FROM COMMAND:"
SAY "     " SOURCELINE(SIGL)
SAY "AT LINE" SIGL"."
